<center><h1>Introduction to SQL</h1></center>

# 1. What is SQL?

 - Structured Query Language
 - Oftern pronounced "sequel" or by simply saying the letters (i.e., "ess cue el")
 - Programming language for relational databases
 - Absolutely ubiquitous
  + Used by industry, governement, academia, everyone!

## 1.1 History, Motivations, and Standardization of SQL

 - Relational model proposed by Ted Codd in 1970
 - First software developed in the 70s and 80s by IBM and Oracle
 - First ANSI standard in 1986
 - Declarative language for querying relational databases

### 1.1.1 What makes SQL a Declarative Language?

- We don't have variables in the traditional sense
- We don't specify steps to take, or operations to peform
  + We don't have explicit loops for iteration
  + Instead we only what the "result set" should contain
  + The only "objects" we can create are `TABLE` objects, which are basically dataframes


## 1.2 Relational Databases

 - Collection of 1 or more tables
 - Tables have columns and rows
   + Rows represent "records"; columns represent "fields" or variables

### 1.2.1 Example Database Schema

<img src="images/relational_db.png" width = "800px"/>

### 1.2.2 Relational Database Management Systems (RDBMS)

  - Software the implents a relational databases
  - Allow us to:
    + create databases
    + create tables in databases
    + create users and control their access
    + query tables to extract data
    + add new data in to tables

### 1.2.3 Varieties of SQL and RDBMS

  - Different RDBMS implement slightly different dialects of SQL
  - RDBMS also provide features not in SQL standard
  - Examples of RDBMS:
    + Microsoft SQL Server
    + Oracle 
    + MySQL
    + PostgreSQL
    + Sqlite

# 2. Typical SQL Query

- Commands that query table(s) in a DB and return some output (often in tabular form)

## 2.1 The `SELECT` Statement

- Often the start of a query
- Specifies the columns we want

### 2.1.1 Motivating Example

- Suppose we run an online retailer (e.g., Amazon)
- We have a database with these tables:
  + `customers`
  + `orders`
  + `products`

In [1]:
%load data/amzn.db

### 2.1.2 Query the `products` Table

In [2]:
SELECT 
    product,           -- these are the columns we want to include
    price,
    product_id
FROM 
    products           -- this is the table we are querying from
;

+-----------+--------+------------+
| product   | price  | product_id |
+-----------+--------+------------+
| rake      | 19.99  | 44         |
+-----------+--------+------------+
| shoe horn | 5.99   | 33         |
+-----------+--------+------------+
| potato    | 0.99   | 22         |
+-----------+--------+------------+
| bike      | 123.5  | 12         |
+-----------+--------+------------+
| table     | 78.55  | 123        |
+-----------+--------+------------+
| cup       | 2.5    | 232        |
+-----------+--------+------------+
| ball      | 5.5    | 28         |
+-----------+--------+------------+
| pencil    | 2.99   | 22         |
+-----------+--------+------------+
| teapot    | 12.49  | 11         |
+-----------+--------+------------+
| fork      | 1.99   | 13         |
+-----------+--------+------------+
| shoelace  | 0.5    | 14         |
+-----------+--------+------------+
| hammer    | 17.49  | 555        |
+-----------+--------+------------+
| door      | 159.99 | 66         |
+-----------+--------+------------+

### 2.1.3 Query the `orders` Table

In [3]:
SELECT 
    order_id,
    customer,
    date
FROM 
    orders
;

+----------+----------+------------+
| order_id | customer | date       |
+----------+----------+------------+
| 1        | lee      | 2018-12-23 |
+----------+----------+------------+
| 2        | smith    | 2020-03-12 |
+----------+----------+------------+
| 3        | jones    | 2019-05-01 |
+----------+----------+------------+
| 4        | yang     | 2020-09-12 |
+----------+----------+------------+
| 5        | guerra   | 2020-08-03 |
+----------+----------+------------+
| 6        | diaz     | 2020-11-28 |
+----------+----------+------------+
| 7        | riley    | 2019-05-18 |
+----------+----------+------------+
| 8        | chan     | 2018-10-03 |
+----------+----------+------------+

### 2.1.3 Query using `SELECT *`

In [4]:
SELECT 
    *
FROM 
    orders
;

+----------+----------+------------+------------+----------+
| order_id | customer | date       | product_id | quantity |
+----------+----------+------------+------------+----------+
| 1        | lee      | 2018-12-23 | 44         | 1        |
+----------+----------+------------+------------+----------+
| 2        | smith    | 2020-03-12 | 33         | 1        |
+----------+----------+------------+------------+----------+
| 3        | jones    | 2019-05-01 | 212        | 2        |
+----------+----------+------------+------------+----------+
| 4        | yang     | 2020-09-12 | 12         | 1        |
+----------+----------+------------+------------+----------+
| 5        | guerra   | 2020-08-03 | 12         | 2        |
+----------+----------+------------+------------+----------+
| 6        | diaz     | 2020-11-28 | 123        | 2        |
+----------+----------+------------+------------+----------+
| 7        | riley    | 2019-05-18 | 232        | 4        |
+----------+----------+------------+------------+----------+
| 8        | chan     | 2018-10-03 | 28         | 1        |
+----------+----------+------------+------------+----------+

### 2.1.4 Query Without Formatting

- Capitalization, indentation, and other formatting oftern doesn't matter in SQL
- But you should use good standards, so others can read your code

In [5]:
select * from orders;

+----------+----------+------------+------------+----------+
| order_id | customer | date       | product_id | quantity |
+----------+----------+------------+------------+----------+
| 1        | lee      | 2018-12-23 | 44         | 1        |
+----------+----------+------------+------------+----------+
| 2        | smith    | 2020-03-12 | 33         | 1        |
+----------+----------+------------+------------+----------+
| 3        | jones    | 2019-05-01 | 212        | 2        |
+----------+----------+------------+------------+----------+
| 4        | yang     | 2020-09-12 | 12         | 1        |
+----------+----------+------------+------------+----------+
| 5        | guerra   | 2020-08-03 | 12         | 2        |
+----------+----------+------------+------------+----------+
| 6        | diaz     | 2020-11-28 | 123        | 2        |
+----------+----------+------------+------------+----------+
| 7        | riley    | 2019-05-18 | 232        | 4        |
+----------+----------+------------+------------+----------+
| 8        | chan     | 2018-10-03 | 28         | 1        |
+----------+----------+------------+------------+----------+

## 2.2 Ordering the Result Set

- We can use the `ORDER BY` statement to control the order of our results

In [6]:
SELECT 
    * 
FROM 
    products
ORDER BY 
    price
;

+------------+-----------+--------+-------------+
| product_id | product   | price  | supplier_id |
+------------+-----------+--------+-------------+
| 14         | shoelace  | 0.5    | 8787        |
+------------+-----------+--------+-------------+
| 22         | potato    | 0.99   | 65656       |
+------------+-----------+--------+-------------+
| 13         | fork      | 1.99   | 86787       |
+------------+-----------+--------+-------------+
| 11         | teapot    | 12.49  | 6565        |
+------------+-----------+--------+-------------+
| 12         | bike      | 123.5  | 232         |
+------------+-----------+--------+-------------+
| 66         | door      | 159.99 | 9889        |
+------------+-----------+--------+-------------+
| 555        | hammer    | 17.49  | 7878        |
+------------+-----------+--------+-------------+
| 44         | rake      | 19.99  | 65656       |
+------------+-----------+--------+-------------+
| 232        | cup       | 2.5    | 4333        |
+------------+-----------+--------+-------------+
| 22         | pencil    | 2.99   | 3232        |
+------------+-----------+--------+-------------+
| 28         | ball      | 5.5    | 2323        |
+------------+-----------+--------+-------------+
| 33         | shoe horn | 5.99   | 3434        |
+------------+-----------+--------+-------------+
| 123        | table     | 78.55  | 54545       |
+------------+-----------+--------+-------------+

## 3. The `WHERE` Clause

- We can use `WHERE` to set filering criteria
- Similar to the `filter()` function _dplyr_ in R

## 3.1 Using `WHERE` in Query

In [7]:
SELECT 
    order_id,
    customer,
    date,
    quantity
FROM
    orders
WHERE 
    quantity > 1
;

+----------+----------+------------+----------+
| order_id | customer | date       | quantity |
+----------+----------+------------+----------+
| 3        | jones    | 2019-05-01 | 2        |
+----------+----------+------------+----------+
| 5        | guerra   | 2020-08-03 | 2        |
+----------+----------+------------+----------+
| 6        | diaz     | 2020-11-28 | 2        |
+----------+----------+------------+----------+
| 7        | riley    | 2019-05-18 | 4        |
+----------+----------+------------+----------+

### 3.1.1 More Conditions in `WHERE` Clause

- We can actually specify quite a bit of criteria for rows we want to include using our `WHERE`
  + This includes testing for a columns equality to some value (or set of values)

In [8]:
SELECT 
    order_id,
    customer,
    date,
    quantity
FROM
    orders
WHERE 
    quantity > 1 
    OR customer = 'lee'
;

+----------+----------+------------+----------+
| order_id | customer | date       | quantity |
+----------+----------+------------+----------+
| 1        | lee      | 2018-12-23 | 1        |
+----------+----------+------------+----------+
| 3        | jones    | 2019-05-01 | 2        |
+----------+----------+------------+----------+
| 5        | guerra   | 2020-08-03 | 2        |
+----------+----------+------------+----------+
| 6        | diaz     | 2020-11-28 | 2        |
+----------+----------+------------+----------+
| 7        | riley    | 2019-05-18 | 4        |
+----------+----------+------------+----------+

# 4. `JOIN` Allows us to Expand our Query's Result Set

- If you'll recall, we used `leftjoin()` from _dplyr_ in R
  + This function was inspired by SQL
  + Frequently hear the term "SQL-style join"

## 4.1 Some Terminology

- Joins are performed by using a given column that appears in both tables being joined
- Frequently, the column being used to join on is "primary key" or a "foreign key"
  + A primary key is the column that acts as the unique identifier for a given record (i.e., row) 
  + A foreign key is a column in a table that is associated with a primary key in another table
- Caveat:
  + Both primary keys and foreign keys can be a combination of columns (ignore this for now)

## 4.2 Example `JOIN`

- Recall our `amzn.db` database has several tables
  + `orders`
  + `products`
  + `customer`
- Suppose we want to know what each customer paid for their order
- This will invole a query across `orders` and `products`, since the price information is in the `products` table

In [22]:
%load data/amzn.db

### 4.2.1 Simple Query using `SELECT`

In [10]:
SELECT 
    customer,      -- these are the columns (i.e., "fields") we want
    date,
    product_id
FROM 
    orders         -- this is the table we pull from
;

+----------+------------+------------+
| customer | date       | product_id |
+----------+------------+------------+
| lee      | 2018-12-23 | 44         |
+----------+------------+------------+
| smith    | 2020-03-12 | 33         |
+----------+------------+------------+
| jones    | 2019-05-01 | 212        |
+----------+------------+------------+
| yang     | 2020-09-12 | 12         |
+----------+------------+------------+
| guerra   | 2020-08-03 | 12         |
+----------+------------+------------+
| diaz     | 2020-11-28 | 123        |
+----------+------------+------------+
| riley    | 2019-05-18 | 232        |
+----------+------------+------------+
| chan     | 2018-10-03 | 28         |
+----------+------------+------------+

## 4.3 Motivating Example

- Suppose we want to obtian the total cost of every order 
- Note that our `orders` table does not contain price information
- The `orders` table does have a `product_id` field
  + the `product_id` field can be used to link (i.e., "join") to the `product` table

In [11]:
SELECT 
    customer,
    quantity,
    product,
    price
FROM 
    orders
    JOIN products ON orders.product_id = products.product_id
;

+----------+----------+-----------+-------+
| customer | quantity | product   | price |
+----------+----------+-----------+-------+
| lee      | 1        | rake      | 19.99 |
+----------+----------+-----------+-------+
| smith    | 1        | shoe horn | 5.99  |
+----------+----------+-----------+-------+
| yang     | 1        | bike      | 123.5 |
+----------+----------+-----------+-------+
| guerra   | 2        | bike      | 123.5 |
+----------+----------+-----------+-------+
| diaz     | 2        | table     | 78.55 |
+----------+----------+-----------+-------+
| riley    | 4        | cup       | 2.5   |
+----------+----------+-----------+-------+
| chan     | 1        | ball      | 5.5   |
+----------+----------+-----------+-------+

### 4.3.1 Using Table Aliases 

- It is more idiomatic to alias our table names to something short (e.g., `ord` for `orders`) 
- We can then use that in the `SELECT` section of our query

In [12]:
SELECT 
    ord.customer,
    ord.quantity,
    ord.product_id,
    pro.product,
    pro.price
FROM
    orders        AS ord 
    JOIN products AS pro ON ord.product_id = pro.product_id
;

+----------+----------+------------+-----------+-------+
| customer | quantity | product_id | product   | price |
+----------+----------+------------+-----------+-------+
| lee      | 1        | 44         | rake      | 19.99 |
+----------+----------+------------+-----------+-------+
| smith    | 1        | 33         | shoe horn | 5.99  |
+----------+----------+------------+-----------+-------+
| yang     | 1        | 12         | bike      | 123.5 |
+----------+----------+------------+-----------+-------+
| guerra   | 2        | 12         | bike      | 123.5 |
+----------+----------+------------+-----------+-------+
| diaz     | 2        | 123        | table     | 78.55 |
+----------+----------+------------+-----------+-------+
| riley    | 4        | 232        | cup       | 2.5   |
+----------+----------+------------+-----------+-------+
| chan     | 1        | 28         | ball      | 5.5   |
+----------+----------+------------+-----------+-------+

### 4.3.2 Doing Math in `SELECT` Section

In [13]:
SELECT 
    ord.customer,
    ord.quantity,
    ord.product_id,
    pro.product,
    pro.price,
    (pro.price * ord.quantity) AS total_cost
FROM
    orders        AS ord 
    JOIN products AS pro ON ord.product_id = pro.product_id
;

+----------+----------+------------+-----------+-------+------------+
| customer | quantity | product_id | product   | price | total_cost |
+----------+----------+------------+-----------+-------+------------+
| lee      | 1        | 44         | rake      | 19.99 | 19.99      |
+----------+----------+------------+-----------+-------+------------+
| smith    | 1        | 33         | shoe horn | 5.99  | 5.99       |
+----------+----------+------------+-----------+-------+------------+
| yang     | 1        | 12         | bike      | 123.5 | 123.5      |
+----------+----------+------------+-----------+-------+------------+
| guerra   | 2        | 12         | bike      | 123.5 | 247.0      |
+----------+----------+------------+-----------+-------+------------+
| diaz     | 2        | 123        | table     | 78.55 | 157.1      |
+----------+----------+------------+-----------+-------+------------+
| riley    | 4        | 232        | cup       | 2.5   | 10.0       |
+----------+----------+------------+-----------+-------+------------+
| chan     | 1        | 28         | ball      | 5.5   | 5.5        |
+----------+----------+------------+-----------+-------+------------+

### 4.3.3 Filtering Result using `WHERE`

- Suppose we only care about order with 2 or more items

In [14]:
SELECT 
    ord.customer,
    ord.quantity,
    ord.product_id,
    pro.product,
    pro.price,
    (pro.price * ord.quantity) AS total_cost
FROM 
    orders        AS ord 
    JOIN products AS pro ON ord.product_id = pro.product_id 
WHERE 
    ord.quantity > 1
;

+----------+----------+------------+---------+-------+------------+
| customer | quantity | product_id | product | price | total_cost |
+----------+----------+------------+---------+-------+------------+
| guerra   | 2        | 12         | bike    | 123.5 | 247.0      |
+----------+----------+------------+---------+-------+------------+
| diaz     | 2        | 123        | table   | 78.55 | 157.1      |
+----------+----------+------------+---------+-------+------------+
| riley    | 4        | 232        | cup     | 2.5   | 10.0       |
+----------+----------+------------+---------+-------+------------+

### 4.3.4 Filtering on Multiple Criteria

- Recall that we can use the `WHERE` clause to filter according to any number of criteria
- Suppose we want either orders with more than 2 items _or_ those with a _particular_ item

In [19]:
SELECT 
    ord.customer,
    ord.quantity,
    ord.product_id,
    pro.product,
    pro.price,
    (pro.price * ord.quantity) AS total_cost
FROM 
    orders        AS ord 
    JOIN products AS pro ON ord.product_id = pro.product_id 
WHERE 
    ord.quantity > 1
    OR pro.product IN ('rake', 'bike')
;

+----------+----------+------------+---------+-------+------------+
| customer | quantity | product_id | product | price | total_cost |
+----------+----------+------------+---------+-------+------------+
| lee      | 1        | 44         | rake    | 19.99 | 19.99      |
+----------+----------+------------+---------+-------+------------+
| yang     | 1        | 12         | bike    | 123.5 | 123.5      |
+----------+----------+------------+---------+-------+------------+
| guerra   | 2        | 12         | bike    | 123.5 | 247.0      |
+----------+----------+------------+---------+-------+------------+
| diaz     | 2        | 123        | table   | 78.55 | 157.1      |
+----------+----------+------------+---------+-------+------------+
| riley    | 4        | 232        | cup     | 2.5   | 10.0       |
+----------+----------+------------+---------+-------+------------+

# 5 Aggregating using `GROUP BY`

 * SQL also makes it easy to aggregate and summarize data
 * The `GROUP BY` command allows us to apply "aggregate functions"
    + For example `SUM()` and `MAX()`

## 5.1 Motivating Example `GROUP BY`

- Suppose we want to get the total number of items sold for each `product_id`

In [44]:
SELECT 
    product_id,
    SUM(quantity)       -- SUM() is our aggregate function
FROM
    orders
GROUP BY 
    product_id
;

+------------+--------------------------------------------------------+
| product_id | SUM(quantity)       -- SUM() is our aggregate function |
+------------+--------------------------------------------------------+
| 12         | 3                                                      |
+------------+--------------------------------------------------------+
| 123        | 2                                                      |
+------------+--------------------------------------------------------+
| 212        | 2                                                      |
+------------+--------------------------------------------------------+
| 232        | 4                                                      |
+------------+--------------------------------------------------------+
| 28         | 1                                                      |
+------------+--------------------------------------------------------+
| 33         | 1                                                      |
+------------+--------------------------------------------------------+
| 44         | 1                                                      |
+------------+--------------------------------------------------------+

<center><h1>Challenge Question:</h1></center> 

Write a SQL query that returns the total revenue collected across all sales. As a hint, this will need to involve a `JOIN`.

In [39]:
SELECT 
    
    (price*quantity) AS order_total,
    *
FROM 
    orders  
    JOIN products ON orders.product_id = products.product_id

+-------------+----------+----------+------------+------------+----------+------------+-----------+-------+-------------+
| order_total | order_id | customer | date       | product_id | quantity | product_id | product   | price | supplier_id |
+-------------+----------+----------+------------+------------+----------+------------+-----------+-------+-------------+
| 19.99       | 1        | lee      | 2018-12-23 | 44         | 1        | 44         | rake      | 19.99 | 65656       |
+-------------+----------+----------+------------+------------+----------+------------+-----------+-------+-------------+
| 5.99        | 2        | smith    | 2020-03-12 | 33         | 1        | 33         | shoe horn | 5.99  | 3434        |
+-------------+----------+----------+------------+------------+----------+------------+-----------+-------+-------------+
| 123.5       | 4        | yang     | 2020-09-12 | 12         | 1        | 12         | bike      | 123.5 | 232         |
+-------------+----------+----------+------------+------------+----------+------------+-----------+-------+-------------+
| 247.0       | 5        | guerra   | 2020-08-03 | 12         | 2        | 12         | bike      | 123.5 | 232         |
+-------------+----------+----------+------------+------------+----------+------------+-----------+-------+-------------+
| 157.1       | 6        | diaz     | 2020-11-28 | 123        | 2        | 123        | table     | 78.55 | 54545       |
+-------------+----------+----------+------------+------------+----------+------------+-----------+-------+-------------+
| 10.0        | 7        | riley    | 2019-05-18 | 232        | 4        | 232        | cup       | 2.5   | 4333        |
+-------------+----------+----------+------------+------------+----------+------------+-----------+-------+-------------+
| 5.5         | 8        | chan     | 2018-10-03 | 28         | 1        | 28         | ball      | 5.5   | 2323        |
+-------------+----------+----------+------------+------------+----------+------------+-----------+-------+-------------+

In [34]:
SELECT 
SUM(quantity * price) AS total_revenue
FROM
orders AS o
JOIN products AS p ON o.product_id = p.product_id

+---------------+
| total_revenue |
+---------------+
| 569.08        |
+---------------+